Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/InformationRegisters/ПС_КэшКонкурентнойРазведки/ПС_КэшКонкурентнойРазведки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПС_КэшКонкурентнойРазведки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Выполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ОтветСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочноеВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументАнализа</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/Catalogs/ПС_НастройкиРаспознавания/ПС_НастройкиРаспознавания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПС_НастройкиРаспознавания</name>
  <predefined>
    <items>
      <name>АдресСервисаРаспознаванияДокументов</name>
      <description>Адрес сервиса распознавания документов</description>
    </items>
    <items>
      <name>ЛогинN8N</name>
      <description>Логин сервиса</description>
    </items>
    <items>
      <name>ПарольN8N</name>
      <description>Пароль сервиса</description>
    </items>
    <items>
      <name>ОсновнаяЛицензия</name>
      <description>Основная лицензия</description>
    </items>
    <items>
      <name>РезервнаяЛицензия</name>
      <description>Резервная лицензия</description>
    </items>
    <items>
      <name>ИспользоватьКомпонентуОкантовки</name>
      <description>Использовать компоненту окантовки</description>
    </items>
    <items>
      <name>ПорогТочностиДляДополнительногоПоискаИИ</name>
      <description>Порог точности для дополнительного поиска ИИ</description>
    </items>
    <items>
      <name>ПорогТочностиДляПрикрепленияДокументов</name>
      <description>Порог точности для прикрепления документов</description>
    </items>
    <items>
      <name>ГлубинаИИПоискаМес</name>
      <description>Глубина ИИ поиска (мес)</description>
    </items>
    <items>
      <name>КоличествоСтрокДляПоискаДокументаИИ</name>
      <description>Количество строк для поиска документа ИИ</description>
    </items>
    <items>
      <name>КоличествоПопытокАвтоматическогоРаспознавания</name>
      <description>Количество попыток автоматического распознавания</description>
    </items>
    <items>
      <name>ИнтервалАвтоматическойОбработкиМин</name>
      <description>Интервал автоматической обработки мин</description>
    </items>
    <items>
      <name>ОткрыватьСканированиеПриНачалеРаботы</name>
      <description>Открывать сканирование при начале работы</description>
    </items>
    <items>
      <name>СоздаватьКонтрагентовАвтоматическиПриЗагрузке</name>
      <description>Создавать контрагентов автоматически при загрузке</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Бухгалтерия_предприятия_разработка_WIN.ПотоковоеСканирование/src/CommonModules/ПС_N8NВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция КонкурентнаяРазведкаN8N(МассивНоменклатуры, СписокСайтовДляАнализа, ДокументАнализа) Экспорт
	
	РазмерВыборки = 0;
	
	ДанныеКэша = ПолучитьОтветСервисаИзКэша(ДокументАнализа, РазмерВыборки);
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("РезультатПолучен", Ложь);
	РезультатОбработки.Вставить("Результат", Новый Массив);
	РезультатОбработки.Вставить("Комментарий", "");
	
	Если ЗначениеЗаполнено(ДанныеКэша) Тогда
	
		РезультатОбработки.Результат = ПС_ИндексацияФайловВызовСервера.JSONВСтруктуру(ДанныеКэша);
		РезультатОбработки.РезультатПолучен = Истина;	
		Возврат РезультатОбработки;		
		
	КонецЕсли;
	
	Если РазмерВыборки >= 100 Тогда
	
		РезультатОбработки.Комментарий = "Тестовый период окончен";
		Возврат РезультатОбработки;
		
	КонецЕсли;
	    
	// Определение нужного микросервиса и запроса к N8N
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("model", "competitors");
	СтруктураДанных.Вставить("competitors", СписокСайтовДляАнализа);
	СтруктураДанных.Вставить("variants", МассивНоменклатуры);
	
	ОтметитьСтатусВыполненияАнализаПоДокументу(ДокументАнализа, Истина);  
	
	Попытка

		Результат = ПС_КоннекторHTTP.PostJSON(АдресМикросервиса("Распознавание"), СтруктураДанных, 
		Новый Структура("Аутентификация,Заголовки,Таймаут", Аутентификация_N8N(), Заголовки_N8N(), 120));
	
		ЕстьДанные = Ложь;
		
		РезультатОбработки.Результат = ПС_ИндексацияФайловВызовСервера.JSONВСтруктуру(Результат["output"]);
		ЕстьДанные = Истина;
				
		Если ЕстьДанные Тогда
			

			РезультатОбработки.РезультатПолучен = Истина;
			
		КонецЕсли;
		
	Исключение
		
		РезультатОбработки.Комментарий = "Ошибка: " + ОписаниеОшибки();
		
	КонецПопытки;
	
	Если РезультатОбработки.РезультатПолучен Тогда
	
		ОтметитьСтатусВыполненияАнализаПоДокументу(ДокументАнализа, Ложь, ПС_ИндексацияФайловВызовСервера.СтруктураВJSON(РезультатОбработки.Результат)); 	
		
	Иначе
		
		ОтметитьСтатусВыполненияАнализаПоДокументу(ДокументАнализа, Ложь); 
		
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

Процедура ОтметитьСтатусВыполненияАнализаПоДокументу(ДокументАнализа, СтатусВыполнения, РезультатРаботыСервиса = "")
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	НаборЗаписей = РегистрыСведений.ПС_КэшКонкурентнойРазведки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументАнализа.Установить(ДокументАнализа);
	НаборЗаписей.Отбор.ВерсияДанных.Установить(ДокументАнализа.ВерсияДанных);
	НаборЗаписей.Отбор.Период.Установить(Сегодня);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Очистить();
		
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ДокументАнализа = ДокументАнализа;
	НоваяЗапись.ВерсияДанных = ДокументАнализа.ВерсияДанных;
	НоваяЗапись.ТочноеВремя = ТекущаяДатаСеанса();
	НоваяЗапись.Период = Сегодня;
		
	НоваяЗапись.Выполняется = СтатусВыполнения;
	НоваяЗапись.ОтветСервиса = РезультатРаботыСервиса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьОтветСервисаИзКэша(ДокументАнализа, РазмерВыборки = 0) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ПС_КэшКонкурентнойРазведки.ДокументАнализа) КАК КоличествоДокументовАнализа
	|ПОМЕСТИТЬ РазмерКэша
	|ИЗ
	|	РегистрСведений.ПС_КэшКонкурентнойРазведки КАК ПС_КэшКонкурентнойРазведки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПС_КэшКонкурентнойРазведки.ОтветСервиса КАК ОтветСервиса,
	|	РазмерКэша.КоличествоДокументовАнализа КАК КоличествоДокументовАнализаВКэше
	|ИЗ
	|	РегистрСведений.ПС_КэшКонкурентнойРазведки КАК ПС_КэшКонкурентнойРазведки,
	|	РазмерКэша КАК РазмерКэша
	|ГДЕ
	|	ПС_КэшКонкурентнойРазведки.ДокументАнализа = &ДокументАнализа
	|	И ПС_КэшКонкурентнойРазведки.ВерсияДанных = &ВерсияДанных
	|	И ПС_КэшКонкурентнойРазведки.Период = &Период
	|	И НЕ ПС_КэшКонкурентнойРазведки.Выполняется";
	
	Запрос.УстановитьПараметр("ДокументАнализа", ДокументАнализа);
	Запрос.УстановитьПараметр("ВерсияДанных", ДокументАнализа.ВерсияДанных);
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	
	Выборка.Следующий();
	
	РазмерВыборки = Выборка.КоличествоДокументовАнализаВКэше;
	
	Возврат Выборка.ОтветСервиса;
	
КонецФункции

Функция ЕстьОчередьКонкурентногоАнализа() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПС_КэшКонкурентнойРазведки.ДокументАнализа КАК ОтветСервиса
	|ИЗ
	|	РегистрСведений.ПС_КэшКонкурентнойРазведки КАК ПС_КэшКонкурентнойРазведки
	|ГДЕ
	|	ПС_КэшКонкурентнойРазведки.Выполняется";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	РазмерВыборки = Выборка.Количество();
	
	Выборка.Следующий();
	Возврат Выборка.ОтветСервиса;
	
КонецФункции


// Выполняет распознавание документа N8N
// 
// Параметры:
//  ДДСкана - ДвоичныеДанные - двоичные данные скана
// 
// Возвращаемое значение:
//  Структура - результат распознавания:
//   * ОбработанУспешно - Булево - признак успешного выполнения распознавания
//   * Комментарий - Строка - комментарий в случае ошибки
//   * РаспознанныеДанные - Структура - данные распознанного документа
//   * КлючевыеРеквизиты - Структура - ключевые реквизиты распознанного документа
Функция РаспознатьДокументN8N(ДДСкана) Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ОбработанУспешно", Ложь);
	РезультатОбработки.Вставить("Комментарий", "");
	РезультатОбработки.Вставить("РаспознанныеДанные", Новый Структура);
	РезультатОбработки.Вставить("КлючевыеРеквизиты", Новый Структура);
	
	ДД_64 = Base64Строка(ДДСкана);
		    
	// Определение структуры
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("model", "mistral");
	    
	Сообщения = Новый Массив;
	    
		СообщениеСистемы = Новый Структура;
		СообщениеСистемы.Вставить("document_base64", ДД_64);
	
	Сообщения.Add(СообщениеСистемы);
	    
	СтруктураДанных.Вставить("messages", Сообщения);
	
	Попытка

		Результат = ПС_КоннекторHTTP.PostJSON(АдресМикросервиса("Распознавание"), СтруктураДанных, 
		Новый Структура("Аутентификация,Заголовки,Таймаут", Аутентификация_N8N(), Заголовки_N8N(), 120));
	
		КодВозврата 		= Строка(Результат["code"]);
		СервисноеСообщение 	= Строка(Результат["message"]);
		Совет 				= Строка(Результат["hint"]);
	
		ЕстьДанные = Ложь;

		Для каждого ТекЭлемент Из Результат["output"] Цикл
		
			РезультатОбработки.РаспознанныеДанные.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);	
			
			Если ПС_ИндексацияФайловВызовСервера.ЭтоКлючевойРеквизит(ТекЭлемент.Ключ) Тогда
			
				РезультатОбработки.КлючевыеРеквизиты.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);
				
			КонецЕсли;
			
			ЕстьДанные = Истина;
	
		КонецЦикла;	
		
		Если ЕстьДанные Тогда
		
			РезультатОбработки.ОбработанУспешно = Истина;
			
		КонецЕсли;
		
	Исключение
		
		РезультатОбработки.Комментарий = "Ошибка: " + ОписаниеОшибки() + " Код: " + КодВозврата + " Сообщение: " + СервисноеСообщение + " Совет N8N: " + Совет;
		
		Если ПС_ИндексацияФайловВызовСервера.ПолучитьНастройкуРаспознавания("РежимТестированияСервиса") = Истина Тогда
			
			ПС_ОбщегоНазначенияВызовСервера.СообщитьПользователю(РезультатОбработки.Комментарий);
			
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат РезультатОбработки;
	
КонецФункции

// Функция выполняет поиск документа в сервисе N8N
//
// Параметры:
//  СтруктураКлючевыхРеквизитов - Структура - структура ключевых реквизитов
//  МассивВариантов - Массив из Строка
//
// Возвращаемое значение:
//  Структура - результат обработки
//	
Функция ПоискДокументаN8N(СтруктураКлючевыхРеквизитов, МассивВариантов) Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ОбработанУспешно", Ложь);
	РезультатОбработки.Вставить("Результат", Новый Структура);
	РезультатОбработки.Вставить("Комментарий", "");
	    
	// Определение нужного микросервиса и запроса к N8N
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("model", "search");
	    
	Сообщения = Новый Массив;
		    
		СообщениеСистемы = Новый Структура;
		СообщениеСистемы.Вставить("request", СтруктураКлючевыхРеквизитов);
		СообщениеСистемы.Вставить("variants", МассивВариантов);
		Сообщения.Add(СообщениеСистемы);
	    
	СтруктураДанных.Вставить("messages", Сообщения);
	
	Попытка

		Результат = ПС_КоннекторHTTP.PostJSON(АдресМикросервиса("Распознавание"), СтруктураДанных, 
		Новый Структура("Аутентификация,Заголовки,Таймаут", Аутентификация_N8N(), Заголовки_N8N(), 120));
	
		ЕстьДанные = Ложь;

		Для каждого ТекЭлемент Из Результат["output"] Цикл
		
			РезультатОбработки.Результат.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);
			
			ЕстьДанные = Истина;
	
		КонецЦикла;	
		
		Если ЕстьДанные Тогда
			
			РезультатОбработки.Результат.accuracy = ПС_СлужебныеФункцииВызовСервера.Число2(РезультатОбработки.Результат.accuracy);
			РезультатОбработки.Результат.date = XMLЗначение(Тип("Дата"), СтруктураКлючевыхРеквизитов.date);
		
			РезультатОбработки.ОбработанУспешно = Истина;
			
		КонецЕсли;
		
	Исключение
		
		РезультатОбработки.Комментарий = "Ошибка: " + ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Аутентификация_N8N()

	Логин = Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("ЛогинN8N");
	Пароль = Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("ПарольN8N");

	Аутентификация = ПС_КоннекторHTTP.НоваяАутентификацияBasic(Логин, Пароль);
	    
	Возврат Аутентификация;
	
КонецФункции

Функция Заголовки_N8N()
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("x-client-id", "");
	
	Возврат Заголовки;
	
КонецФункции

Функция АдресМикросервиса(ИмяМикросервиса)
	
	Если Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("РежимТестированияСервиса") = Истина Тогда
		
		Возврат Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("АдресТестовогоКонтураСервиса");
		
	Иначе
	
		Если ИмяМикросервиса = "Распознавание" Тогда
			
			Возврат Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("АдресСервисаРаспознаванияДокументов");
			
		Иначе
			
			ВызватьИсключение "Сервис не поддерживается";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
